### dev01 - Terraform Plan
#### Terraform Initialization success
#### Terraform Validation success
#### Terraform Format and Style success
#### Terraform Plan success

<details><summary>dev01 - Plan</summary>

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.mod1.aws_ssm_parameter.favourite will be created
  + resource "aws_ssm_parameter" "favourite" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "The parameter description"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = "alias/aws/ssm"
      + name           = "/tftest/dev01/food"
      + tags           = {
          + "Name" = "/tftest/dev01/food"
        }
      + tags_all       = {
          + "Name"             = "/tftest/dev01/food"
          + "account"          = "dev"
          + "account_full"     = "Dev Environment"
          + "costcentre"       = "123"
          + "deployment_mode"  = "auto"
          + "deployment_repo"  = "git://github.com/potteringabout/terraform-devops.git"
          + "email"            = "tone@potteringabout.net"
          + "environment"      = "dev01"
          + "environment_full" = "Dev env 1"
          + "owner"            = "potteringabout"
          + "project"          = "tftest"
          + "project_full"     = "Terraform Test"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.mod2.aws_ssm_parameter.favourite will be created
  + resource "aws_ssm_parameter" "favourite" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "The parameter description"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = "alias/aws/ssm"
      + name           = "/tftest/dev01/colour"
      + tags           = {
          + "Name" = "/tftest/dev01/colour"
        }
      + tags_all       = {
          + "Name"             = "/tftest/dev01/colour"
          + "account"          = "dev"
          + "account_full"     = "Dev Environment"
          + "costcentre"       = "123"
          + "deployment_mode"  = "auto"
          + "deployment_repo"  = "git://github.com/potteringabout/terraform-devops.git"
          + "email"            = "tone@potteringabout.net"
          + "environment"      = "dev01"
          + "environment_full" = "Dev env 1"
          + "owner"            = "potteringabout"
          + "project"          = "tftest"
          + "project_full"     = "Terraform Test"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...



</details>

* Triggered by: @AntonyPotter, Action: pull_request